export const provincesData = [
  {
    name: "กรุงเทพมหานคร",
    districts: [
      {
        name: "พระนคร",
        subdistricts: [
          "พระบรมมหาราชวัง",
          "วังบูรพาภิรมย์",
          "วัดราชบพิธ",
          "สำราญราษฎร์",
          "ศาลเจ้าพ่อเสือ",
          "เสาชิงช้า",
          "บวรนิเวศ",
          "ตลาดยอด",
          "ชนะสงคราม",
          "บ้านพานถม",
          "บางขุนพรหม",
          "วัดสามพระยา",
        ],
      },
      {
        name: "ดุสิต",
        subdistricts: [
          "ดุสิต",
          "วชิรพยาบาล",
          "สวนจิตรลดา",
          "สี่แยกมหานาค",
          "ถนนนครไชยศรี",
        ],
      },
      {
        name: "หนองจอก",
        subdistricts: [
          "กระทุ่มราย",
          "หนองจอก",
          "คลองสิบ",
          "คลองสิบสอง",
          "โคกแฝด",
          "คู้ฝั่งเหนือ",
          "ลำผักชี",
          "ลำต้อยติ่ง",
        ],
      },
      {
        name: "บางรัก",
        subdistricts: ["มหาพฤฒาราม", "สุริยวงศ์", "บางรัก", "สีลม", "สี่พระยา"],
      },
      {
        name: "บางเขน",
        subdistricts: ["อนุสาวรีย์", "ท่าแร้ง"],
      },
      {
        name: "บางกะปิ",
        subdistricts: ["คลองจั่น", "หัวหมาก"],
      },
      {
        name: "ปทุมวัน",
        subdistricts: ["ปทุมวัน", "รองเมือง", "วังใหม่", "ลุมพินี"],
      },
      {
        name: "ป้อมปราบศัตรูพ่าย",
        subdistricts: [
          "ป้อมปราบ",
          "วัดเทพศิรินทร์",
          "คลองมหานาค",
          "บ้านบาตร",
          "วัดโสมนัส",
        ],
      },
      {
        name: "พระโขนง",
        subdistricts: ["บางจาก", "พระโขนงเหนือ"],
      },
      {
        name: "มีนบุรี",
        subdistricts: [
          "มีนบุรี",
          "แสนแสบ",
          "บางชัน",
          "คลองสอง",
          "คลองหกวา",
          "สวนหลวง",
          "หนองจอก",
        ],
      },
      {
        name: "ลาดกระบัง",
        subdistricts: [
          "ลาดกระบัง",
          "คลองสามประเวศ",
          "คลองหลวงแพ่ง",
          "สนามบิน",
          "หนองบอน",
          "สวนหลวง",
          "ประเวศ",
          "คลองสิบสอง",
        ],
      },
      {
        name: "ยานนาวา",
        subdistricts: ["ช่องนนทรี", "บางโพงพาง", "ทุ่งมหาเมฆ", "บางรัก"],
      },
      {
        name: "สัมพันธวงศ์",
        subdistricts: ["จักรวรรดิ", "สำเพ็ง", "ตลาดน้อย", "บุปผา"],
      },
      {
        name: "พญาไท",
        subdistricts: [
          "สามเสนใน",
          "สามเสนใน (การแบ่งขยาย)",
          "พญาไท",
          "ถนนพญาไท",
          "ทุ่งพญาไท",
          "ประตูน้ำ",
        ],
      },
      {
        name: "ธนบุรี",
        subdistricts: [
          "วัดกัลยาณ์",
          "หิรัญรูจี",
          "บางยี่เรือ",
          "บุคคโล",
          "ตลาดพลู",
          "ดาวคะนอง",
          "สำเหร่",
        ],
      },
      {
        name: "บางกอกใหญ่",
        subdistricts: ["วัดอรุณ", "วัดท่าพระ", "สมเด็จเจ้าพระยา", "บางยี่ขัน"],
      },
      {
        name: "ห้วยขวาง",
        subdistricts: [
          "ห้วยขวาง",
          "บางกะปิ",
          "ดินแดง",
          "ราชเทวี",
          "นวลจันทร์",
          "จตุจักร",
        ],
      },
      {
        name: "คลองสาน",
        subdistricts: [
          "คลองต้นไทร",
          "คลองสาน",
          "บางลำภูล่าง",
          "สมเด็จเจ้าพระยา",
        ],
      },
      {
        name: "ตลิ่งชัน",
        subdistricts: [
          "คลองชักพระ",
          "ตลิ่งชัน",
          "ฉิมพลี",
          "บางพรม",
          "บางระมาด",
          "บางเชือกหนัง",
        ],
      },
      {
        name: "บางกอกน้อย",
        subdistricts: [
          "ศิริราช",
          "บ้านช่างหล่อ",
          "บางขุนนนท์",
          "บางขุนศรี",
          "อรุณอมรินทร์",
        ],
      },
      {
        name: "บางขุนเทียน",
        subdistricts: ["บางขุนเทียน", "บางค้อ", "บางบอน", "ท่าข้าม"],
      },
      {
        name: "ภาษีเจริญ",
        subdistricts: ["คลองขวาง", "บางแค", "บางแคเหนือ", "บางไผ่", "บางหว้า"],
      },
      {
        name: "หนองแขม",
        subdistricts: ["หนองแขม", "หนองค้างพลู"],
      },
      {
        name: "ราษฎร์บูรณะ",
        subdistricts: ["ราษฎร์บูรณะ", "บางปะกอก"],
      },
      {
        name: "บางพลัด",
        subdistricts: ["บางพลัด", "บางอ้อ", "บางบำหรุ", "บางยี่ขัน"],
      },
      {
        name: "ดินแดง",
        subdistricts: ["ดินแดง"],
      },
      {
        name: "บึงกุ่ม",
        subdistricts: ["คลองกุ่ม", "สะพานสูง", "นวลจันทร์"],
      },
      {
        name: "สาทร",
        subdistricts: ["ทุ่งวัดดอน", "ยานนาวา", "ทุ่งมหาเมฆ"],
      },
      {
        name: "บางซื่อ",
        subdistricts: ["บางซื่อ", "วงศ์สว่าง"],
      },
      {
        name: "จตุจักร",
        subdistricts: [
          "จอมพล",
          "จตุจักร",
          "ลาดยาว",
          "เสนานิคม",
          "จันทรเกษม",
          "เสนาใน",
        ],
      },
      {
        name: "บางคอแหลม",
        subdistricts: ["บางคอแหลม", "วัดพระยาไกร", "บางโคล่"],
      },
      {
        name: "ประเวศ",
        subdistricts: ["ประเวศ", "ดอกไม้", "หนองบอน"],
      },
      {
        name: "คลองเตย",
        subdistricts: ["คลองเตย", "คลองตัน", "พระโขนง"],
      },
      {
        name: "สวนหลวง",
        subdistricts: ["สวนหลวง"],
      },
      {
        name: "จอมทอง",
        subdistricts: ["บางขุนเทียน", "บางขุนเทียนใต้", "บางขุนเทียนเหนือ"],
      },
      {
        name: "ดอนเมือง",
        subdistricts: ["สีกัน", "ดอนเมือง"],
      },
      {
        name: "ราชเทวี",
        subdistricts: ["ทุ่งพญาไท", "ถนนพญาไท", "มักกะสัน"],
      },
      {
        name: "ลาดพร้าว",
        subdistricts: ["ลาดพร้าว", "จรเข้บัว"],
      },
      {
        name: "วัฒนา",
        subdistricts: ["คลองเตยเหนือ", "คลองตันเหนือ", "พระโขนงเหนือ"],
      },
      {
        name: "บางแค",
        subdistricts: ["บางแค", "บางแคเหนือ", "บางไผ่", "บางหว้า"],
      },
      {
        name: "หลักสี่",
        subdistricts: ["ตลาดบางเขน", "ทุ่งสองห้อง"],
      },
      {
        name: "สายไหม",
        subdistricts: ["สายไหม", "ออเงิน", "คลองถนน"],
      },
      {
        name: "คันนายาว",
        subdistricts: ["คันนายาว"],
      },
      {
        name: "สะพานสูง",
        subdistricts: ["สะพานสูง"],
      },
      {
        name: "วังทองหลาง",
        subdistricts: ["วังทองหลาง", "สะพานสอง", "สามเสนนอก"],
      },
      {
        name: "คลองสามวา",
        subdistricts: ["ทรายกองดิน", "ทรายกองดินใต้", "บางชัน", "คลองสามวา"],
      },
      {
        name: "บางนา",
        subdistricts: ["บางนา"],
      },
      {
        name: "ทวีวัฒนา",
        subdistricts: ["ศาลาธรรมสพน์", "ทวีวัฒนา"],
      },
      {
        name: "ทุ่งครุ",
        subdistricts: ["ทุ่งครุ", "บางมด"],
      },
      {
        name: "บางบอน",
        subdistricts: ["บางบอนใต้", "บางบอนเหนือ"],
      },
    ],
  },
  {
    name: "ปทุมธานี",
    districts: [
      {
        name: "เมืองปทุมธานี",
        subdistricts: [
          "บางปรอก",
          "บ้านใหม่",
          "บ้านกระแชง",
          "บางขะแยง",
          "บางคูวัด",
          "บางหลวง",
          "บางเดื่อ",
          "บางพูด",
          "บางพูน",
          "บางขวด",
        ],
      },
      {
        name: "คลองหลวง",
        subdistricts: [
          "คลองหนึ่ง",
          "คลองสอง",
          "คลองสาม",
          "คลองสี่",
          "คลองห้า",
          "คลองหก",
          "คลองเจ็ด",
        ],
      },
      {
        name: "ธัญบุรี",
        subdistricts: [
          "ประชาธิปัตย์",
          "บึงน้ำ",
          "ลำผักกูด",
          "รังสิต",
          "คลองหก",
        ],
      },
      {
        name: "หนองเสือ",
        subdistricts: ["บึงบอน", "บึงบา", "บึงชำอ้อ", "บึงกาสาม", "บึงทองหลาง"],
      },
      {
        name: "ลาดหลุมแก้ว",
        subdistricts: [
          "ลาดหลุมแก้ว",
          "คลองพระอุดม",
          "บ่อเงิน",
          "คูบางหลวง",
          "คลองควาย",
        ],
      },
      {
        name: "ลำลูกกา",
        subdistricts: [
          "คูคต",
          "ลาดสวาย",
          "บึงคำพร้อย",
          "ลำลูกกา",
          "บึงทองหลาง",
          "ลำผักชี",
        ],
      },
      {
        name: "สามโคก",
        subdistricts: [
          "คลองควาย",
          "บ้านงิ้ว",
          "เชียงรากน้อย",
          "สามโคก",
          "กระแชง",
          "คลองควาย",
          "บางเตย",
          "กระแชง",
        ],
      },
    ],
  },
];
